{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 441, 1], "input_dtype": "float32", "sparse": false, "name": "wavInputs"}, "inbound_nodes": [], "name": "wavInputs"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 441], "input_dtype": "float32", "sparse": false, "name": "freqInputs"}, "inbound_nodes": [], "name": "freqInputs"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 1, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["wavInputs", 0, 0]]], "name": "hidden1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden10", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 441, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["freqInputs", 0, 0]]], "name": "hidden10"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 512}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["hidden1", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 512}}, "trainable": true, "name": "timedistributed_5"}, "inbound_nodes": [[["hidden10", 0, 0]]], "name": "timedistributed_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}}, "trainable": true, "name": "timedistributed_2"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "timedistributed_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}}, "trainable": true, "name": "timedistributed_6"}, "inbound_nodes": [[["timedistributed_5", 0, 0]]], "name": "timedistributed_6"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden4", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["timedistributed_2", 0, 0]]], "name": "hidden4"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden13", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["timedistributed_6", 0, 0]]], "name": "hidden13"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 256}}, "trainable": true, "name": "timedistributed_3"}, "inbound_nodes": [[["hidden4", 0, 0]]], "name": "timedistributed_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 256}}, "trainable": true, "name": "timedistributed_7"}, "inbound_nodes": [[["hidden13", 0, 0]]], "name": "timedistributed_7"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, "trainable": true, "name": "timedistributed_4"}, "inbound_nodes": [[["timedistributed_3", 0, 0]]], "name": "timedistributed_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden15", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, "trainable": true, "name": "timedistributed_8"}, "inbound_nodes": [[["timedistributed_7", 0, 0]]], "name": "timedistributed_8"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden7", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["timedistributed_4", 0, 0]]], "name": "hidden7"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "hidden16", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["timedistributed_8", 0, 0]]], "name": "hidden16"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 128}, "inbound_nodes": [[["hidden7", 0, 0]]], "name": "hidden8"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden17", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 128}, "inbound_nodes": [[["hidden16", 0, 0]]], "name": "hidden17"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["hidden8", 0, 0]]], "name": "hidden9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden18", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["hidden17", 0, 0]]], "name": "hidden18"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["hidden9", 0, 0], ["hidden18", 0, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden19", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 256}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "hidden19"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden20", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}, "inbound_nodes": [[["hidden19", 0, 0]]], "name": "hidden20"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden21", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 128}, "inbound_nodes": [[["hidden20", 0, 0]]], "name": "hidden21"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden23", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 256}, "inbound_nodes": [[["hidden20", 0, 0]]], "name": "hidden23"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden22", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["hidden21", 0, 0]]], "name": "hidden22"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden24", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}, "inbound_nodes": [[["hidden23", 0, 0]]], "name": "hidden24"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "gender", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}, "inbound_nodes": [[["hidden22", 0, 0]]], "name": "gender"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "age", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["hidden24", 0, 0]]], "name": "age"}], "input_layers": [["wavInputs", 0, 0], ["freqInputs", 0, 0]], "output_layers": [["gender", 0, 0], ["age", 0, 0]], "name": "model_1"}}